[
  {
    "title": "Customer-Relationship-Management(CRM)",
    "imageSrc": "projects/techUpdate.png",
    "description": "A full-featured Customer Relationship Management platform designed to streamline client interactions, sales tracking, and task management. It includes role-based access, real-time analytics, automated follow-ups, and an intuitive dashboard for managing leads and customer data efficiently. Built with a modern tech stack ensuring scalability, performance, and a smooth user experience.",
    "skills": [
      "PHP",
      "JavaScript",
      "MySQL"
    ],
    "demo": "https://arisen.in/crm",
    "source": "https://github.com/Scriptkiddie8/Customer-Relationship-Management-CRM-"
  },
  {
    "title": "QuizQuest",
    "imageSrc": "projects/QuizQuest.png",
    "description": "An interactive quiz application that challenges users with dynamic questions across multiple categories and difficulty levels. It features real-time scoring, progress tracking, and a responsive UI for an engaging experience. Built with a modern tech stack to ensure smooth performance, scalability, and an intuitive user interface.",
    "skills": [
      "React",
      "JavaScript",
      "Vite",
      "Tailwind CSS",
      "Redux"
    ],
    "demo": "https://quiz-quest-k7m9.vercel.app/",
    "source": "https://github.com/Scriptkiddie8/QuizQuest"
  },
  {
    "title": "MatchMe",
    "imageSrc": "projects/MatchMe.png",
    "description": "A full-featured matchmaking platform that connects users based on personalized preferences and AI-driven compatibility scores. It includes profile creation, real-time chat, photo management, premium memberships, and behavior-based matching. With a secure backend, responsive UI, and admin analytics dashboard, MatchMe delivers a modern, scalable, and engaging user experience.",
    "skills": [
      "React",
      "Express",
      "Nodejs",
      "MongoDB",
      "JWT",
      "bcrypt",
      "Socket.io"
    ],
    "demo": "https://match-me-drab.vercel.app/",
    "source": "https://github.com/Scriptkiddie8/MatchMe"
  },
  {
    "title": "Traveling",
    "imageSrc": "projects/Traveling.png",
    "description": "A dynamic travel website that helps users discover destinations, explore trip packages, and plan personalized journeys with ease. It features destination search, image galleries, reviews, and responsive layouts for a seamless browsing experience. Built with modern web technologies to ensure fast performance, elegant design, and an engaging user experience.",
    "skills": [
      "HTML5",
      "CSS3",
      "JavaScript"
    ],
    "demo": "https://travelling-web-beta.vercel.app/",
    "source": "https://github.com/Scriptkiddie8/travelling-web"
  }
]